#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
terraform

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.repository["se-services"].github_branch.branch["develop"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"f9bb41b917478221f8ec012aedeecc90bd5ab48d587ecf4e7534bdc813ed4220\"" -> "W/\"53090212df09760cebb3cbf2a773b95e7f98ecb77f79731c426f7a71fd763b40\""
        id            = "se-services:develop"
        # (6 unchanged attributes hidden)
    }

  # module.repository["website"].github_branch.branch["staging"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"45d490620eeb221169b769a76d3fa968cc31e2818238ece88f8ca6173a817e2c\"" -> "W/\"9de100fee683ce9e7d7008a0545919031a1195426ddb42757d0d47a1305190ad\""
        id            = "website:staging"
        # (5 unchanged attributes hidden)
    }

  # module.repository_lib_template["rust"].github_branch.branch["develop"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"822af7954cfb62a06d3530b6e067d1e47b39bea1072d32f642b35ff334d23a8b\"" -> "W/\"21ca922357bfcd969921d56137a2cee66ba2f7b73f3ee9b7464b66e3958c8575\""
        id            = "lib-template-rust:develop"
        # (6 unchanged attributes hidden)
    }

  # module.repository_rust_lib["router"].github_branch.branch["develop"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"6dcb77dd058f6de2a0eb57c44bc5b886b5443b3f8ad3a39a6ddcd7fc05ab6aee\"" -> "W/\"d6d3b7d5d8721401387c4b9cc106bcfb4095a466081ba98772439eb1f682bf52\""
        id            = "lib-router:develop"
      ~ sha           = "039dab0e3c2bd6d46d6b47a562e4b585f6f2195e" -> "6c5e9ff4dfc0a2de6ee84437efa2c5b2e6dccbc7"
        # (5 unchanged attributes hidden)
    }

  # module.repository_rust_svc["scheduler"].github_branch.branch["develop"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"d441cfc4248050708f4dbf0d1848076f0f4a2aa6d701ad40d419d31c9dce8696\"" -> "W/\"1725a7d8ee00d999f23a94be9a0ceb25330779c9def78fdc1e5207ba0c0e51e0\""
        id            = "svc-scheduler:develop"
      ~ sha           = "fa5fc82beb11780d50d56fbcb4035d6da6f241d4" -> "5cb43a5e13e1e668c803ff11474cc17a1a594e1f"
        # (5 unchanged attributes hidden)
    }

  # module.repository_rust_svc["storage"].github_branch.branch["develop"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"e484a54618b78a82ad1e7e611de6962c8b27f201088001e744cdba5692ff0909\"" -> "W/\"73d67f63d9b69cf1e9746b4db36778f49c067658eda3f068d7ab074d68df8322\""
        id            = "svc-storage:develop"
      ~ sha           = "0c9d282d076cecbd4ddc4e0350116f4d70fad722" -> "fe2e2cf581faf9de05c089b4f86b42fe724d0837"
        # (5 unchanged attributes hidden)
    }

  # module.repository_svc_template["python"].github_branch.branch["develop"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"8567716e48bf4f8c480c3c32f7754c9abc1fdc316ecfdc6e82f5a29b43ec44d7\"" -> "W/\"63d89b5e1af3298af16d594da0516a7549ee622f95346664d074c337aa618f78\""
        id            = "svc-template-python:develop"
        # (6 unchanged attributes hidden)
    }

  # module.repository_svc_template["rust"].github_branch.branch["develop"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"5abc6c99e901f1d1e1ce1ce077c2a161d957666fe9a3e2339f66e5fc86d9df85\"" -> "W/\"27aabba1e6fb6669adfed9ac6c641c560bc5018c84e7217ec2908c5cabbc9f06\""
        id            = "svc-template-rust:develop"
        # (6 unchanged attributes hidden)
    }

  # module.repository_svc_template["typescript"].github_branch.branch["develop"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"3cfe98fae228f53d13f2bf1f81741d340670138f2dce8220f515b92657441875\"" -> "W/\"1cf254258652bf79acbda58c84b48cedf273a9f5e367e07e08855197d4a51c47\""
        id            = "svc-template-typescript:develop"
        # (6 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.repository["benchmarks"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHzRWt84Bqv9O"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository["cla-bot"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHTAbhc4BmmRb"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository["se-services"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOH6H84M4BtBZe"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository["se-services"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOH6H84M4BtBZp"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository["tools"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
      ~ enforce_admins                  = true -> false
        id                              = "BPR_kwDOHn-Jf84BmmRe"
        # (9 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository["tools"].github_repository_file.files[".github/CODEOWNERS"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "main"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            * @Arrow-air/devops @Arrow-air/services @Arrow-air/drone-engineering
        EOT
      + file                = ".github/CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "tools"
      + sha                 = (known after apply)
    }

  # module.repository["website"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOGdyvzM4BiRcN"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository["website"].github_branch_protection.protection["staging"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOGdyvzM4BiRcL"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_lib_template["rust"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHwJLh84BqmYF"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_lib_template["rust"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHwJLh84BqmYD"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_rust_lib["router"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHyi9o84Bqidv"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_rust_lib["router"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHyi9o84Bqid1"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_rust_svc["cargo"].github_branch.branch["develop"] will be created
  + resource "github_branch" "branch" {
      + branch        = "develop"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "svc-cargo"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # module.repository_rust_svc["cargo"].github_branch_default.default will be created
  + resource "github_branch_default" "default" {
      + branch     = "develop"
      + id         = (known after apply)
      + repository = "svc-cargo"
    }

  # module.repository_rust_svc["cargo"].github_branch_protection.all["svc-cargo"] will be created
  + resource "github_branch_protection" "all" {
      + allows_deletions                = true
      + allows_force_pushes             = true
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "*"
      + repository_id                   = "svc-cargo"
      + require_conversation_resolution = false
      + require_signed_commits          = true
      + required_linear_history         = false
    }

  # module.repository_rust_svc["cargo"].github_branch_protection.protection["develop"] will be created
  + resource "github_branch_protection" "protection" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + pattern                         = "develop"
      + repository_id                   = "svc-cargo"
      + require_conversation_resolution = true
      + require_signed_commits          = true
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
          + require_code_owner_reviews      = true
          + required_approving_review_count = 1
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }
    }

  # module.repository_rust_svc["cargo"].github_branch_protection.protection["main"] will be created
  + resource "github_branch_protection" "protection" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + pattern                         = "main"
      + repository_id                   = "svc-cargo"
      + require_conversation_resolution = true
      + require_signed_commits          = true
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
          + require_code_owner_reviews      = true
          + required_approving_review_count = 1
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }
    }

  # module.repository_rust_svc["cargo"].github_repository.repository will be created
  + resource "github_repository" "repository" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + auto_init                   = true
      + branches                    = (known after apply)
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Arrow Service - Public Requests for Cargo Services"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + has_projects                = true
      + has_wiki                    = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + is_template                 = false
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "svc-cargo"
      + node_id                     = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + visibility                  = "public"
      + vulnerability_alerts        = true

      + template {
          + owner      = "Arrow-air"
          + repository = "svc-template-rust"
        }
    }

  # module.repository_rust_svc["cargo"].github_repository_file.files[".cargo-husky/hooks/README.md"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            DO NOT EDIT! This file was provisioned by Terraform
            
            These hooks will be copied to `.git/hooks/` when `cargo test` is run.
            
            :exclamation: If editing these hooks, you will need to delete the `target/`
            directory and re-run `cargo test`.
        EOT
      + file                = ".cargo-husky/hooks/README.md"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-cargo"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["cargo"].github_repository_file.files[".cargo-husky/hooks/pre-commit"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            #!/bin/sh
            #
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            ##
            #
            # This hook was set by cargo-husky v1.5.0: https://github.com/rhysd/cargo-husky#readme
            
            # Style templates for console output.
            GREEN=$(tput setaf 2)
            YELLOW=$(tput setaf 3)
            BOLD=$(tput bold)
            NC=$'\e[0m'
            
            echo -e "${BOLD}${YELLOW}Running the pre-commit hook...${NC}${NC}"
            
            set -e
            
            # RUST
            make rust-test
            
            # PYTHON 3
            make python-test
            
            # TOML formatting
            make toml-test
            
            # Style Check
            make editorconfig-test
            
            # Finish
            echo "${BOLD}${GREEN}🍺 You are good to go!${NC}${NC}"
        EOT
      + file                = ".cargo-husky/hooks/pre-commit"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-cargo"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["cargo"].github_repository_file.files[".cargo-husky/hooks/pre-push"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            #!/bin/sh
            #
            ### DO NOT EDIT!
            # This file was provisioned by Terraform
            #
            # Do nothing
        EOT
      + file                = ".cargo-husky/hooks/pre-push"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-cargo"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["cargo"].github_repository_file.files[".cargo/config.toml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            # DO NOT EDIT
            # This file was provisioned by Terraform
            
            # https://doc.rust-lang.org/cargo/reference/config.html
            
            [build]
            rustflags = [
              "-Wmissing_docs",
              "-Wmissing_debug_implementations",
              "-Wmissing_copy_implementations",
              "-Wtrivial_casts",
              "-Wtrivial_numeric_casts",
              "-Wunsafe_code",
              "-Wunstable_features",
              "-Wunused_import_braces",
              "-Wunused_qualifications",
            ]
        EOT
      + file                = ".cargo/config.toml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-cargo"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["cargo"].github_repository_file.files[".editorconfig"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            
            # EditorConfig helps developers define and maintain consistent
            # coding styles between different editors and IDEs
            # editorconfig.org
            root = true
            [*]
            end_of_line = lf
            charset = utf-8
            trim_trailing_whitespace = true
            insert_final_newline = true
            indent_style = space
            indent_size = 4
            [*.md]
            # double whitespace at end of line
            # denotes a line break in Markdown
            indent_size = off
            trim_trailing_whitespace = false
            [*.yml]
            indent_size = 2
            [Makefile*]
            indent_style = tab
            indent_size = 4
            
        EOT
      + file                = ".editorconfig"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-cargo"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["cargo"].github_repository_file.files[".github/CODEOWNERS"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            * @Arrow-air/services
        EOT
      + file                = ".github/CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-cargo"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["cargo"].github_repository_file.files[".github/workflows/editorconfig_check.yml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            
            name: EditorConfig Check
            
            env:
              TERM: xterm
            
            on:
              push:
                branches:
                  - main
              pull_request:
            
            jobs:
              codestyle:
                name: Code Style
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                  - run: make editorconfig-test
        EOT
      + file                = ".github/workflows/editorconfig_check.yml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-cargo"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["cargo"].github_repository_file.files[".github/workflows/pr_rebase.yml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # Check file validity at: https://rhysd.github.io/actionlint/
            # https://github.com/actions/virtual-environments/blob/main/images/linux/Ubuntu2004-Readme.md
            
            name: PR Rebase
            
            env:
              TERM: xterm
            
            on:
              issue_comment:
                types: [created]
            
            jobs:
              rebase:
                name: Rebase
                if: >-
                  github.event.issue.pull_request != '' &&
                  (
                    contains(github.event.comment.body, '/autosquash') ||
                    contains(github.event.comment.body, '/fixup') ||
                    contains(github.event.comment.body, '/rebase')
                  )
                runs-on: ubuntu-latest
                permissions:
                  issues: write
                  pull-requests: write
                  contents: write
                steps:
                  - name: Checkout the latest code
                    uses: actions/checkout@v3
                    with:
                      token: ${{ secrets.GITHUB_TOKEN }}
                      fetch-depth: 0 # otherwise, you will fail to push refs to dest repo
                  - name: Automatic Rebase
                    uses: cirrus-actions/rebase@1.7
                    with:
                      autosquash: ${{ true }}
                    env:
                      GITHUB_TOKEN: ${{ secrets.GITHUB_TOKEN }}
        EOT
      + file                = ".github/workflows/pr_rebase.yml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-cargo"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["cargo"].github_repository_file.files[".github/workflows/python_ci.yml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # Check file validity at: https://rhysd.github.io/actionlint/
            # https://github.com/actions/virtual-environments/blob/main/images/linux/Ubuntu2004-Readme.md
            
            on:
              push:
                branches:
                - main
              pull_request:
            
            name: Python Checks
            
            env:
              TERM: xterm
            
            jobs:
              formatting-check:
                name: Formatting Check
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                  - run: make python-test
        EOT
      + file                = ".github/workflows/python_ci.yml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-cargo"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["cargo"].github_repository_file.files[".github/workflows/rust_ci.yml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # Check file validity at: https://rhysd.github.io/actionlint/
            # https://github.com/actions/virtual-environments/blob/main/images/linux/Ubuntu2004-Readme.md
            
            on:
              push:
                branches:
                - main
              pull_request:
            
            name: Rust Checks
            
            env:
              TERM: xterm
            
            jobs:
              check:
                name: Checks
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                  - run: make rust-check
            
              build_and_test_debug:
                name: Build & Test
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                  - name: Build
                    run: make build
                  - name: Test
                    run: make rust-test
                  # Coming soon: grcov + push results to website or service (coveralls, etc.)
            
              fmt:
                name: Rustfmt
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                  - run: make rust-fmt
            
              clippy:
                name: Clippy
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                  - run: make rust-clippy
        EOT
      + file                = ".github/workflows/rust_ci.yml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-cargo"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["cargo"].github_repository_file.files[".gitignore"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            
            # Generated by Cargo
            # will have compiled files and executables
            debug/
            target/
            # Local cargo cache generated by make targets
            .cargo/registry
            
            # Remove Cargo.lock from gitignore if creating an executable, leave it for libraries
            # More information here https://doc.rust-lang.org/cargo/guide/cargo-toml-vs-cargo-lock.html
            
            
            # These are backup files generated by rustfmt
            **/*.rs.bk
            
            # MSVC Windows builds of rustc generate these, which store debugging information
            *.pdb
            
            # Don't add vscode meta files
            .vscode
        EOT
      + file                = ".gitignore"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-cargo"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["cargo"].github_repository_file.files[".taplo.toml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            exclude = ["**/.cargo/registry/**"]
            
            [formatting]
            reorder_keys  = false
            align_entries = true
            
            [[rule]]
            include = ["**/Cargo.toml"]
            keys = [
              "dependencies",
              "dev-dependencies",
              "build-dependencies",
              "target",
              "package",
              "workspace",
              "profile",
              "replace",
              "patch",
              "features",
              "badges",
            ]
            
            [rule.formatting]
            reorder_keys = true
        EOT
      + file                = ".taplo.toml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-cargo"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["cargo"].github_repository_file.files["Makefile"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            SHELL := /bin/bash
            
            DOCKER_NAME := arrow-lib-cargo
            IMAGE_NAME  := lib-cargo
            BUILD_IMAGE_NAME := ghcr.io/arrow-air/tools/arrow-rust
            BUILD_IMAGE_TAG := latest
            DOCKER_PORT := 8080
            HOST_PORT := 8000
            
            # We might not have a Cargo.toml file in the root dir
            CARGO_MANIFEST_PATH ?= $(shell find -maxdepth 2 -name Cargo.toml)
            CARGO_INCREMENTAL   ?= 1
            RUSTC_BOOTSTRAP     ?= 0
            
            # Style templates for console output.
            GREEN  := $(shell echo -e `tput setaf 2`)
            YELLOW := $(shell echo -e `tput setaf 3`)
            BOLD   := $(shell echo -e `tput bold`)
            NC     := $(shell echo -e $$'\e[0m')
            
            .PHONY: test build release stop run tidy
            
            # function with a generic template to run docker with the required values
            # Accepts $1 = command to run, $2 = additional flags (optional)
            docker_run = docker run \
                --name=$(DOCKER_NAME)-$@ \
                --rm \
                --user `id -u`:`id -g` \
                -e CARGO_INCREMENTAL=$(CARGO_INCREMENTAL) \
                -e RUSTC_BOOTSTRAP=$(RUSTC_BOOTSTRAP) \
                -v "$(PWD):/usr/src/app" \
                -v "$(PWD)/.cargo/registry:/usr/local/cargo/registry" \
                $(2) \
                -t $(BUILD_IMAGE_NAME):$(BUILD_IMAGE_TAG) \
                $(1)
            
            check-cargo-registry:
            	if [ ! -d "$(PWD)/.cargo/registry" ]; then mkdir -p "$(PWD)/.cargo/registry" ; fi
            
            build: check-cargo-registry
            	@$(call docker_run,cargo build)
            
            test: rust-check rust-test rust-clippy rust-fmt toml-test python-test
            
            rust-check: check-cargo-registry
            	@echo "$(YELLOW)Finding manifest-path for cargo...$(NC)"
            ifeq ("$(CARGO_MANIFEST_PATH)", "")
            	@echo "$(BOLD)$(YELLOW)No Cargo.toml found in any of the subdirectories, skipping cargo check...$(NC)$(NC)"
            else
            	@echo "$(YELLOW)Running cargo check...$(NC)"
            	@$(call docker_run,cargo check --manifest-path "$(CARGO_MANIFEST_PATH)")
            endif
            
            rust-test: check-cargo-registry
            	@echo "$(YELLOW)Finding manifest-path for cargo...$(NC)"
            ifeq ("$(CARGO_MANIFEST_PATH)", "")
            	@echo "$(BOLD)$(YELLOW)No Cargo.toml found in any of the subdirectories, skipping cargo tests...$(NC)$(NC)"
            else
            	@echo "$(YELLOW)Running cargo tests...$(NC)"
            	@$(call docker_run,cargo test --manifest-path "$(CARGO_MANIFEST_PATH)" --all)
            endif
            
            rust-clippy: check-cargo-registry
            ifeq ("$(CARGO_MANIFEST_PATH)", "")
            	@echo "$(BOLD)$(YELLOW)No Cargo.toml found in any of the subdirectories, skipping cargo clippy...$(NC)$(NC)"
            else
            	@echo "$(YELLOW)Linting Rust codes through clippy...$(NC)"
            	@$(call docker_run,cargo clippy --manifest-path "$(CARGO_MANIFEST_PATH)" --all -- -D warnings)
            endif
            
            rust-fmt: check-cargo-registry
            ifeq ("$(CARGO_MANIFEST_PATH)", "")
            	@echo "$(BOLD)$(YELLOW)No Cargo.toml found in any of the subdirectories, skipping cargo fmt...$(NC)$(NC)"
            else
            	@echo "$(YELLOW)Running and checking Rust codes formats...$(NC)"
            	@$(call docker_run,cargo fmt --manifest-path "$(CARGO_MANIFEST_PATH)" --all -- --check)
            endif
            
            rust-tidy: check-cargo-registry
            ifeq ("$(CARGO_MANIFEST_PATH)", "")
            	@echo "$(BOLD)$(YELLOW)No Cargo.toml found in any of the subdirectories, skipping cargo fmt...$(NC)$(NC)"
            else
            	@echo "$(YELLOW)Running rust file formatting fixes...$(NC)"
            	@$(call docker_run,cargo fmt --all)
            endif
            
            rust-tidy: check-cargo-registry
            	@echo "$(YELLOW)Running rust file formatting fixes...$(NC)"
            	@$(call docker_run,cargo fmt --all)
            
            toml-test:
            	@echo "$(YELLOW)Running toml file formatting tests...$(NC)"
            	@$(call docker_run,taplo format --check)
            
            toml-tidy:
            	@echo "$(YELLOW)Running toml file formatting fixes...$(NC)"
            	@$(call docker_run,taplo format)
            
            python-test:
            	@echo "$(YELLOW)Formatting and checking Python files with Google style...$(NC)"
            	@$(call docker_run,yapf -r -i -vv --style google --exclude '.cargo/registry' .)
            	@echo "$(YELLOW)Formatting and checking Python files with flake8 style...$(NC)"
            	@$(call docker_run,flake8 --exclude '.cargo/registry' .)
            
            python-tidy:
            	@echo "$(YELLOW)Running python file formatting fixes...$(NC)"
            	@$(call docker_run,black --extend-exclude .cargo .)
            
            editorconfig-test:
            	@echo "$(YELLOW)Checking if the codebase is compliant with the .editorconfig file...$(NC)"
            	@docker run \
                --name=$(DOCKER_NAME)-$@ \
                --rm \
                --user `id -u`:`id -g` \
                -v "$(PWD):/usr/src/app" \
                -t mstruebing/editorconfig-checker
            
            tidy: rust-tidy toml-tidy python-tidy
            
            release:
            	@$(call docker_run,cargo build --release)
            
            clean: check-cargo-registry
            	@cargo clean
            
            
            run: stop
                # Run docker container as a deamon and map a port
            	@$(call docker_run,sh,-d -p $(HOST_PORT):$(DOCKER_PORT))
            
            stop:
            	@docker kill ${DOCKER_NAME}-run || true
            	@docker rm ${DOCKER_NAME}-run || true
            
            all: test build release run
            
        EOT
      + file                = "Makefile"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-cargo"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["cargo"].github_repository_webhook.map["discord"] will be created
  + resource "github_repository_webhook" "map" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "pull_request",
          + "pull_request_review",
          + "pull_request_review_comment",
          + "pull_request_review_thread",
        ]
      + id         = (known after apply)
      + repository = "svc-cargo"
      + url        = (known after apply)

      + configuration {
          + content_type = "json"
          + insecure_ssl = false
          + url          = (sensitive value)
        }
    }

  # module.repository_rust_svc["cargo"].github_team_repository.maintainer["services"] will be created
  + resource "github_team_repository" "maintainer" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "svc-cargo"
      + team_id    = "services"
    }

  # module.repository_rust_svc["scheduler"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHyi9hc4Bqidr"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_rust_svc["scheduler"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHyi9hc4Bqidt"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_rust_svc["scheduler"].github_repository_file.files["Makefile"] will be updated in-place
  ~ resource "github_repository_file" "files" {
      ~ content             = <<-EOT
            SHELL := /bin/bash
            
            DOCKER_NAME := arrow-lib-scheduler
            IMAGE_NAME  := lib-scheduler
            BUILD_IMAGE_NAME := ghcr.io/arrow-air/tools/arrow-rust
            BUILD_IMAGE_TAG := latest
            DOCKER_PORT := 8080
          - HOST_PORT := 8000
          + HOST_PORT := 8001
            
            # We might not have a Cargo.toml file in the root dir
            CARGO_MANIFEST_PATH ?= $(shell find -maxdepth 2 -name Cargo.toml)
            CARGO_INCREMENTAL   ?= 1
            RUSTC_BOOTSTRAP     ?= 0
            
            # Style templates for console output.
            GREEN  := $(shell echo -e `tput setaf 2`)
            YELLOW := $(shell echo -e `tput setaf 3`)
            BOLD   := $(shell echo -e `tput bold`)
            NC     := $(shell echo -e $$'\e[0m')
            
            .PHONY: test build release stop run tidy
            
            # function with a generic template to run docker with the required values
            # Accepts $1 = command to run, $2 = additional flags (optional)
            docker_run = docker run \
                --name=$(DOCKER_NAME)-$@ \
                --rm \
                --user `id -u`:`id -g` \
                -e CARGO_INCREMENTAL=$(CARGO_INCREMENTAL) \
                -e RUSTC_BOOTSTRAP=$(RUSTC_BOOTSTRAP) \
                -v "$(PWD):/usr/src/app" \
                -v "$(PWD)/.cargo/registry:/usr/local/cargo/registry" \
                $(2) \
                -t $(BUILD_IMAGE_NAME):$(BUILD_IMAGE_TAG) \
                $(1)
            
            check-cargo-registry:
            	if [ ! -d "$(PWD)/.cargo/registry" ]; then mkdir -p "$(PWD)/.cargo/registry" ; fi
            
            build: check-cargo-registry
            	@$(call docker_run,cargo build)
            
            test: rust-check rust-test rust-clippy rust-fmt toml-test python-test
            
            rust-check: check-cargo-registry
            	@echo "$(YELLOW)Finding manifest-path for cargo...$(NC)"
            ifeq ("$(CARGO_MANIFEST_PATH)", "")
            	@echo "$(BOLD)$(YELLOW)No Cargo.toml found in any of the subdirectories, skipping cargo check...$(NC)$(NC)"
            else
            	@echo "$(YELLOW)Running cargo check...$(NC)"
            	@$(call docker_run,cargo check --manifest-path "$(CARGO_MANIFEST_PATH)")
            endif
            
            rust-test: check-cargo-registry
            	@echo "$(YELLOW)Finding manifest-path for cargo...$(NC)"
            ifeq ("$(CARGO_MANIFEST_PATH)", "")
            	@echo "$(BOLD)$(YELLOW)No Cargo.toml found in any of the subdirectories, skipping cargo tests...$(NC)$(NC)"
            else
            	@echo "$(YELLOW)Running cargo tests...$(NC)"
            	@$(call docker_run,cargo test --manifest-path "$(CARGO_MANIFEST_PATH)" --all)
            endif
            
            rust-clippy: check-cargo-registry
            ifeq ("$(CARGO_MANIFEST_PATH)", "")
            	@echo "$(BOLD)$(YELLOW)No Cargo.toml found in any of the subdirectories, skipping cargo clippy...$(NC)$(NC)"
            else
            	@echo "$(YELLOW)Linting Rust codes through clippy...$(NC)"
            	@$(call docker_run,cargo clippy --manifest-path "$(CARGO_MANIFEST_PATH)" --all -- -D warnings)
            endif
            
            rust-fmt: check-cargo-registry
            ifeq ("$(CARGO_MANIFEST_PATH)", "")
            	@echo "$(BOLD)$(YELLOW)No Cargo.toml found in any of the subdirectories, skipping cargo fmt...$(NC)$(NC)"
            else
            	@echo "$(YELLOW)Running and checking Rust codes formats...$(NC)"
            	@$(call docker_run,cargo fmt --manifest-path "$(CARGO_MANIFEST_PATH)" --all -- --check)
            endif
            
            rust-tidy: check-cargo-registry
            ifeq ("$(CARGO_MANIFEST_PATH)", "")
            	@echo "$(BOLD)$(YELLOW)No Cargo.toml found in any of the subdirectories, skipping cargo fmt...$(NC)$(NC)"
            else
            	@echo "$(YELLOW)Running rust file formatting fixes...$(NC)"
            	@$(call docker_run,cargo fmt --all)
            endif
            
            rust-tidy: check-cargo-registry
            	@echo "$(YELLOW)Running rust file formatting fixes...$(NC)"
            	@$(call docker_run,cargo fmt --all)
            
            toml-test:
            	@echo "$(YELLOW)Running toml file formatting tests...$(NC)"
            	@$(call docker_run,taplo format --check)
            
            toml-tidy:
            	@echo "$(YELLOW)Running toml file formatting fixes...$(NC)"
            	@$(call docker_run,taplo format)
            
            python-test:
            	@echo "$(YELLOW)Formatting and checking Python files with Google style...$(NC)"
            	@$(call docker_run,yapf -r -i -vv --style google --exclude '.cargo/registry' .)
            	@echo "$(YELLOW)Formatting and checking Python files with flake8 style...$(NC)"
            	@$(call docker_run,flake8 --exclude '.cargo/registry' .)
            
            python-tidy:
            	@echo "$(YELLOW)Running python file formatting fixes...$(NC)"
            	@$(call docker_run,black --extend-exclude .cargo .)
            
            editorconfig-test:
            	@echo "$(YELLOW)Checking if the codebase is compliant with the .editorconfig file...$(NC)"
            	@docker run \
                --name=$(DOCKER_NAME)-$@ \
                --rm \
                --user `id -u`:`id -g` \
                -v "$(PWD):/usr/src/app" \
                -t mstruebing/editorconfig-checker
            
            tidy: rust-tidy toml-tidy python-tidy
            
            release:
            	@$(call docker_run,cargo build --release)
            
            clean: check-cargo-registry
            	@cargo clean
            
            
            run: stop
                # Run docker container as a deamon and map a port
            	@$(call docker_run,sh,-d -p $(HOST_PORT):$(DOCKER_PORT))
            
            stop:
            	@docker kill ${DOCKER_NAME}-run || true
            	@docker rm ${DOCKER_NAME}-run || true
            
            all: test build release run
            
        EOT
        id                  = "svc-scheduler/Makefile"
        # (9 unchanged attributes hidden)
    }

  # module.repository_rust_svc["storage"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHyi9jc4BqieG"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_rust_svc["storage"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHyi9jc4BqieF"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_rust_svc["storage"].github_repository_file.files["Makefile"] will be updated in-place
  ~ resource "github_repository_file" "files" {
      ~ content             = <<-EOT
            SHELL := /bin/bash
            
            DOCKER_NAME := arrow-lib-storage
            IMAGE_NAME  := lib-storage
            BUILD_IMAGE_NAME := ghcr.io/arrow-air/tools/arrow-rust
            BUILD_IMAGE_TAG := latest
            DOCKER_PORT := 8080
          - HOST_PORT := 8001
          + HOST_PORT := 8002
            
            # We might not have a Cargo.toml file in the root dir
            CARGO_MANIFEST_PATH ?= $(shell find -maxdepth 2 -name Cargo.toml)
            CARGO_INCREMENTAL   ?= 1
            RUSTC_BOOTSTRAP     ?= 0
            
            # Style templates for console output.
            GREEN  := $(shell echo -e `tput setaf 2`)
            YELLOW := $(shell echo -e `tput setaf 3`)
            BOLD   := $(shell echo -e `tput bold`)
            NC     := $(shell echo -e $$'\e[0m')
            
            .PHONY: test build release stop run tidy
            
            # function with a generic template to run docker with the required values
            # Accepts $1 = command to run, $2 = additional flags (optional)
            docker_run = docker run \
                --name=$(DOCKER_NAME)-$@ \
                --rm \
                --user `id -u`:`id -g` \
                -e CARGO_INCREMENTAL=$(CARGO_INCREMENTAL) \
                -e RUSTC_BOOTSTRAP=$(RUSTC_BOOTSTRAP) \
                -v "$(PWD):/usr/src/app" \
                -v "$(PWD)/.cargo/registry:/usr/local/cargo/registry" \
                $(2) \
                -t $(BUILD_IMAGE_NAME):$(BUILD_IMAGE_TAG) \
                $(1)
            
            check-cargo-registry:
            	if [ ! -d "$(PWD)/.cargo/registry" ]; then mkdir -p "$(PWD)/.cargo/registry" ; fi
            
            build: check-cargo-registry
            	@$(call docker_run,cargo build)
            
            test: rust-check rust-test rust-clippy rust-fmt toml-test python-test
            
            rust-check: check-cargo-registry
            	@echo "$(YELLOW)Finding manifest-path for cargo...$(NC)"
            ifeq ("$(CARGO_MANIFEST_PATH)", "")
            	@echo "$(BOLD)$(YELLOW)No Cargo.toml found in any of the subdirectories, skipping cargo check...$(NC)$(NC)"
            else
            	@echo "$(YELLOW)Running cargo check...$(NC)"
            	@$(call docker_run,cargo check --manifest-path "$(CARGO_MANIFEST_PATH)")
            endif
            
            rust-test: check-cargo-registry
            	@echo "$(YELLOW)Finding manifest-path for cargo...$(NC)"
            ifeq ("$(CARGO_MANIFEST_PATH)", "")
            	@echo "$(BOLD)$(YELLOW)No Cargo.toml found in any of the subdirectories, skipping cargo tests...$(NC)$(NC)"
            else
            	@echo "$(YELLOW)Running cargo tests...$(NC)"
            	@$(call docker_run,cargo test --manifest-path "$(CARGO_MANIFEST_PATH)" --all)
            endif
            
            rust-clippy: check-cargo-registry
            ifeq ("$(CARGO_MANIFEST_PATH)", "")
            	@echo "$(BOLD)$(YELLOW)No Cargo.toml found in any of the subdirectories, skipping cargo clippy...$(NC)$(NC)"
            else
            	@echo "$(YELLOW)Linting Rust codes through clippy...$(NC)"
            	@$(call docker_run,cargo clippy --manifest-path "$(CARGO_MANIFEST_PATH)" --all -- -D warnings)
            endif
            
            rust-fmt: check-cargo-registry
            ifeq ("$(CARGO_MANIFEST_PATH)", "")
            	@echo "$(BOLD)$(YELLOW)No Cargo.toml found in any of the subdirectories, skipping cargo fmt...$(NC)$(NC)"
            else
            	@echo "$(YELLOW)Running and checking Rust codes formats...$(NC)"
            	@$(call docker_run,cargo fmt --manifest-path "$(CARGO_MANIFEST_PATH)" --all -- --check)
            endif
            
            rust-tidy: check-cargo-registry
            ifeq ("$(CARGO_MANIFEST_PATH)", "")
            	@echo "$(BOLD)$(YELLOW)No Cargo.toml found in any of the subdirectories, skipping cargo fmt...$(NC)$(NC)"
            else
            	@echo "$(YELLOW)Running rust file formatting fixes...$(NC)"
            	@$(call docker_run,cargo fmt --all)
            endif
            
            rust-tidy: check-cargo-registry
            	@echo "$(YELLOW)Running rust file formatting fixes...$(NC)"
            	@$(call docker_run,cargo fmt --all)
            
            toml-test:
            	@echo "$(YELLOW)Running toml file formatting tests...$(NC)"
            	@$(call docker_run,taplo format --check)
            
            toml-tidy:
            	@echo "$(YELLOW)Running toml file formatting fixes...$(NC)"
            	@$(call docker_run,taplo format)
            
            python-test:
            	@echo "$(YELLOW)Formatting and checking Python files with Google style...$(NC)"
            	@$(call docker_run,yapf -r -i -vv --style google --exclude '.cargo/registry' .)
            	@echo "$(YELLOW)Formatting and checking Python files with flake8 style...$(NC)"
            	@$(call docker_run,flake8 --exclude '.cargo/registry' .)
            
            python-tidy:
            	@echo "$(YELLOW)Running python file formatting fixes...$(NC)"
            	@$(call docker_run,black --extend-exclude .cargo .)
            
            editorconfig-test:
            	@echo "$(YELLOW)Checking if the codebase is compliant with the .editorconfig file...$(NC)"
            	@docker run \
                --name=$(DOCKER_NAME)-$@ \
                --rm \
                --user `id -u`:`id -g` \
                -v "$(PWD):/usr/src/app" \
                -t mstruebing/editorconfig-checker
            
            tidy: rust-tidy toml-tidy python-tidy
            
            release:
            	@$(call docker_run,cargo build --release)
            
            clean: check-cargo-registry
            	@cargo clean
            
            
            run: stop
                # Run docker container as a deamon and map a port
            	@$(call docker_run,sh,-d -p $(HOST_PORT):$(DOCKER_PORT))
            
            stop:
            	@docker kill ${DOCKER_NAME}-run || true
            	@docker rm ${DOCKER_NAME}-run || true
            
            all: test build release run
            
        EOT
        id                  = "svc-storage/Makefile"
        # (9 unchanged attributes hidden)
    }

  # module.repository_svc_template["python"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHrbxrc4BqmXs"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_svc_template["python"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHrbxrc4BqmXr"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_svc_template["rust"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHn-JXc4BqmXz"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_svc_template["rust"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHn-JXc4Bqprl"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_svc_template["typescript"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHtu-d84BqmXu"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_svc_template["typescript"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHtu-d84BqmXx"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_tf["github"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOG6VIns4BpLGe"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 22 to add, 24 to change, 0 to destroy.

Changes to Outputs:
  ~ repositories = {
      ~ se-services   = {
          ~ branch         = {
              ~ develop = {
                  ~ etag          = "W/\"f9bb41b917478221f8ec012aedeecc90bd5ab48d587ecf4e7534bdc813ed4220\"" -> "W/\"53090212df09760cebb3cbf2a773b95e7f98ecb77f79731c426f7a71fd763b40\""
                    id            = "se-services:develop"
                    # (6 unchanged elements hidden)
                }
            }
            # (2 unchanged elements hidden)
        }
      ~ website       = {
          ~ branch         = {
              ~ staging = {
                  ~ etag          = "W/\"45d490620eeb221169b769a76d3fa968cc31e2818238ece88f8ca6173a817e2c\"" -> "W/\"9de100fee683ce9e7d7008a0545919031a1195426ddb42757d0d47a1305190ad\""
                    id            = "website:staging"
                    # (6 unchanged elements hidden)
                }
            }
            # (2 unchanged elements hidden)
        }
        # (4 unchanged elements hidden)
    }

```

</details>

*Pusher: @ServiceDog, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*